In [1]:
from pandas import *

In [3]:
def roundToMilions(value):
    result = round(value / 1000000)
    return result

In [29]:
a = float(4254326.54)

In [30]:
type(a)

float

In [44]:
b = -1927352.16

In [31]:
roundToMilions(a)

4.0

In [45]:
roundToMilions(b)

-2.0

In [132]:
def usdToGbp(usd):
    return usd / 1.564768

In [133]:
usdToGbp(-1)

-0.6390723736681732

In [54]:
def expandCountry(name):
    if name == 'UK':
        return 'United Kingdom'
    elif name == 'USA':
        return 'United States'
    else:
        return name

In [57]:
expandCountry('UK')

'United Kingdom'

In [58]:
expandCountry('USA')

'United States'

In [60]:
expandCountry('India')

'India'

In [62]:
def expandCountry2(name):
    if name == 'UK':
        name = 'United Kingdom'
    if name == 'USA':
        name = 'United States'
    return name

In [64]:
expandCountry2('UK')

'United Kingdom'

In [74]:
# Exercise 3
def translateCountry(name):
    if name == 'Brasil':
        name = 'Brazil'
    if name == 'Espana':
        name = 'Spain'
    if name == 'Deutschland':
        name = 'Germany'
        
    return name

In [76]:
translateCountry('Deutschland')

'Germany'

In [78]:
headings = ['Country', 'GDP (US$)']
table = [
  ['UK', 2678454886796.7],    # 1st row
  ['USA', 16768100000000.0],  # 2nd row
  ['China', 9240270452047.0], # and so on...
  ['Brazil', 2245673032353.8],
  ['South Africa', 366057913367.1]
]
gdp = DataFrame(columns=headings, data=table)
gdp

        Country     GDP (US$)
0            UK  2.678455e+12
1           USA  1.676810e+13
2         China  9.240270e+12
3        Brazil  2.245673e+12
4  South Africa  3.660579e+11

In [90]:
headings = ['Country', 'Population 2013']
table = [
    ['Brazil', 200362],
    ['Russia', 142834],
    ['India', 1252140],
    ['China', 1393337],
    ['South Africa', 52776]
]

population = DataFrame(columns=headings, data=table)
population

        Country  Population 2013
0        Brazil           200362
1        Russia           142834
2         India          1252140
3         China          1393337
4  South Africa            52776

In [95]:
for i in population['Population 2013']:
    popul = roundToMilions(i)
    print popul

0.0
0.0
1.0
1.0
0.0

In [96]:
headings = ['Country name', 'Life expectancy (years)']
table = [
  ['China', 75],
  ['Russia', 71],  
  ['United States', 79],
  ['India', 66],
  ['United Kingdom', 81]
]
life = DataFrame(columns=headings, data=table)
life

     Country name  Life expectancy (years)
0           China                       75
1          Russia                       71
2   United States                       79
3           India                       66
4  United Kingdom                       81

In [98]:
gdp['Country name'] = gdp['Country'].apply(expandCountry)
gdp

        Country     GDP (US$)    Country name
0            UK  2.678455e+12  United Kingdom
1           USA  1.676810e+13   United States
2         China  9.240270e+12           China
3        Brazil  2.245673e+12          Brazil
4  South Africa  3.660579e+11    South Africa

In [99]:
gdp['GDP (£m)'] = gdp['GDP (US$)'].apply(usdToGdp).apply(roundToMilions)
gdp

        Country     GDP (US$)    Country name  GDP (£m)
0            UK  2.678455e+12  United Kingdom   1711727
1           USA  1.676810e+13   United States  10716029
2         China  9.240270e+12           China   5905202
3        Brazil  2.245673e+12          Brazil   1435148
4  South Africa  3.660579e+11    South Africa    233937

In [102]:
gdp['GDP (US$)'].apply(roundToMilions).apply(usdToGdp).apply(round)

0     1711727
1    10716029
2     5905201
3     1435148
4      233938
Name: GDP (US$), dtype: float64

In [103]:
headings = ['Country name', 'GDP (£m)']
gdp = gdp[headings]
gdp

     Country name  GDP (£m)
0  United Kingdom   1711727
1   United States  10716029
2           China   5905202
3          Brazil   1435148
4    South Africa    233937

In [105]:
life

     Country name  Life expectancy (years)
0           China                       75
1          Russia                       71
2   United States                       79
3           India                       66
4  United Kingdom                       81

In [106]:
gdp

     Country name  GDP (£m)
0  United Kingdom   1711727
1   United States  10716029
2           China   5905202
3          Brazil   1435148
4    South Africa    233937

In [113]:
#merge(gdp, life, on='Country name', how='left')

In [114]:
merge(gdp, life, on='Country name', how='right')

     Country name  GDP (£m)  Life expectancy (years)
0  United Kingdom   1711727                       81
1   United States  10716029                       79
2           China   5905202                       75
3          Russia       NaN                       71
4           India       NaN                       66

In [115]:
merge(gdp, life, on='Country name', how='outer')

     Country name  GDP (£m)  Life expectancy (years)
0  United Kingdom   1711727                       81
1   United States  10716029                       79
2           China   5905202                       75
3          Brazil   1435148                      NaN
4    South Africa    233937                      NaN
5          Russia       NaN                       71
6           India       NaN                       66

In [116]:
merge(gdp, life, on='Country name', how='inner')

     Country name  GDP (£m)  Life expectancy (years)
0  United Kingdom   1711727                       81
1   United States  10716029                       79
2           China   5905202                       75

In [118]:
from pandas.io.wb import download

year = 2013
gdp_indicator = 'NY.GDP.MKTP.CD'
gdp = download(indicator=gdp_indicator, country='all', start=year, end=year)
life_indicator = 'SP.DYN.LE00.IN'
life = download(indicator = life_indicator, country='all', start=year, end=year)
life.head()

                                              SP.DYN.LE00.IN
country                                 year
Arab World                              2013       70.085925
Caribbean small states                  2013       72.000083
Central Europe and the Baltics          2013       76.127583
East Asia & Pacific (all income levels) 2013       74.894858
East Asia & Pacific (developing only)   2013       73.982971

In [128]:
gdp = gdp.reset_index()
life = life.reset_index()
life.head()

ValueError: cannot insert level_0, already exists

In [137]:
life[0:3]

   level_0  index                         country  year  SP.DYN.LE00.IN
0        0      0                      Arab World  2013       70.085925
1        1      1          Caribbean small states  2013       72.000083
2        2      2  Central Europe and the Baltics  2013       76.127583

In [139]:
life[240:]

     level_0  index                country  year  SP.DYN.LE00.IN
240      240    240             Uzbekistan  2013       68.227585
241      241    241                Vanuatu  2013       71.686829
242      242    242          Venezuela, RB  2013       74.643098
243      243    243                Vietnam  2013       75.756488
244      244    244  Virgin Islands (U.S.)  2013       79.624390
245      245    245     West Bank and Gaza  2013       73.203341
246      246    246            Yemen, Rep.  2013       63.089585
247      247    247                 Zambia  2013       58.092780
248      248    248               Zimbabwe  2013       59.773488

In [144]:
gdp = gdp[34:]
life = life[34:]
gdp.head()

     level_0  index        country  year  NY.GDP.MKTP.CD
170      170    170    Netherlands  2013    8.535394e+11
171      171    171  New Caledonia  2013             NaN
172      172    172    New Zealand  2013    1.883849e+11
173      173    173      Nicaragua  2013    1.085073e+10
174      174    174          Niger  2013    7.683045e+09